events_old/app/views/events/index.html.erb

SELECT  "events".* FROM "events"  LIMIT 1
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "events"  LIMIT 1) subquery_for_count
---
<h1><%= pluralize(@events.length, 'Event') %></h1>