events_old/app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  LIMIT 1
---
    def index
        @events = Event.all

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "name" = ?, "price" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "Bug Smash Deluxe"], ["price", 59.0], ["starts_at", "2015-03-12 02:02:00.000000"], ["updated_at", "2014-12-03 22:58:46.358837"]]
---
    def update
       @event = Event.find(params[:id])
       @event.update(event_params)